# ArrowheadType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ArrowheadType Property
ParameterTypeId Class See Also
---
"Arrowhead Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ArrowheadType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ArrowheadType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ArrowheadType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace